public class HomeWork1 {
    //1. Создать пустой проект в IntelliJ IDEA и прописать метод main().
    public static void main(String[] args) {
        System.out.println();

    }
}


//Второе задание

